{
  "What is assisted living?": "Assisted living is a residential care option for seniors who need help with daily activities like bathing, dressing, or medication management, but don't require 24/7 medical care. It combines housing, personal care services, and health care as needed.",
  
  "What is memory care?": "Memory care is specialized care for individuals with Alzheimer's, dementia, or other memory impairments. It provides a secure environment with trained staff, structured activities, and specialized programming to support cognitive function and safety.",
  
  "How much does assisted living cost?": "Assisted living costs vary by location and care needs, typically ranging from $3,500 to $7,000 per month. The national median is around $4,500/month. Factors affecting cost include room type, level of care needed, and geographic location.",
  
  "What is in-home care?": "In-home care allows seniors to receive assistance while remaining in their own home. Services can include personal care, companionship, meal preparation, medication reminders, and light housekeeping. Care can range from a few hours per week to 24/7 support.",
  
  "Does Medicare cover assisted living?": "Medicare does not cover the cost of assisted living room and board. However, Medicare may cover some medical services provided in assisted living, such as doctor visits, hospice care, or medical equipment. Medicaid may help cover costs in some states.",
  
  "What's the difference between assisted living and nursing home?": "Assisted living focuses on helping with daily activities in a residential setting, while nursing homes (skilled nursing facilities) provide 24/7 medical care for those with significant health needs. Nursing homes have licensed nurses on staff and can handle complex medical conditions.",
  
  "How do I know what level of care is needed?": "Our Guided Care Plan assessment evaluates mobility, daily living activities, cognitive function, medical needs, and safety concerns to recommend the appropriate level of care. This comprehensive assessment takes about 15-20 minutes to complete.",
  
  "What is the Guided Care Plan?": "The Guided Care Plan is our comprehensive assessment tool that evaluates your loved one's care needs across multiple dimensions including daily activities, cognitive function, mobility, medical complexity, and safety. It provides personalized recommendations for the appropriate level of care.",
  
  "Can I afford senior care?": "Our Cost Planner helps you understand care costs and explore payment options including savings, income, VA benefits, long-term care insurance, Medicaid, and reverse mortgages. We'll help you create a realistic financial plan based on your specific situation.",
  
  "What are ADLs?": "ADLs (Activities of Daily Living) are basic self-care tasks including bathing, dressing, eating, toileting, transferring (moving from bed to chair), and continence. The number of ADLs a person needs help with is a key factor in determining appropriate care level."
}
